[
  {
    "name": "Sri Krishna College of Engineering and Technology",
    "url": "https://srikrishna.ac.in/images/Institution-Logo.png",
    "code": "2718",
    "map": "https://maps.app.goo.gl/jb5yghvqkMnmHCH17",
    "district": "Coimbatore",
    "rank": "77",
    "num": " 0422 267 8001",
    "short": "SKCET",
    "link": "https://www.skcet.ac.in/",
    "address": "Bk Pudur,Kuniamuthur,Coimbatore-641008",
    "mail": "skcet2012@gmail.com",
    "para": "Sri Krishna College of Engineering and Technology is the most sought after Institution among the premier technical Institutions in South India. Since its establishment in the year 1998, the Institution has marched towards the pinnacle of glory through its remarkable achievements in the field of Engineering Education. It is an Autonomous Institution, accredited with ‘A’ Grade (3.42 out of 4 scale) by NAAC and 7 programmes being accredited by NBA and it offers 11 UG programmes, 8 PG programmes, 1 integrated programme and 4 research programmes. The Institution offers an exciting academic environment with well qualified 354 dedicated faculty members to inspire and nurture the student fraternity. With industry drafted Choice Based Credit System (CBCS) curriculum and syllabi, the Institution takes every effort to bring its students to the forefront of the society as skillful and responsible engineers.",
    "Degree": [
      {
        "id": 0,
        "name": "B.E. Computer Science and  Engineering (Cyber Security)"
      },
      { "id": 1, "name": "B.E. Mechanical Engineering" },
      { "id": 2, "name": "B.E. Civil Engineering" }
    ]
  },
  {
    "name": "Coimbatore Institute of Technology",
    "url": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQEK6r5-LBOUJhppo4ptwu2pdxJQE52oyuKlBtT6emiSyR76BHOwepLEYG3Q5Q5okoFTLg&usqp=CAU",
    "code": "2007",
    "map": "https://maps.app.goo.gl/MJ4P6p8EZC2Bsssx9",
    "district": "Coimbatore",
    "rank": "101",
    "short": "CIT",
    "num": "91- 422 – 2574071",
    "link": "https://www.cit.edu.in/",
    "address": "Hope College,Coimbatore-641004",
    "mail": "ao@cit.edu.in",
    "para": "Coimbatore Institute of Technology (CIT) is an autonomous government-aided institution. Affiliated with Anna University, Chennai, it is recognised by the AICTE and has been awarded an ‘A’ Grade by NAAC and also by the National Board of Accreditation (NBA). Established in 1956 by the V Rangaswamy Naidu Educational Trust (VRET), Coimbatore Institute of Technology offers UG, PG and Integrated MSc programmes as well as doctoral programmes.",
    "Degree": [
      {
        "id": 3,
        "name": "B.E.  Electronics and Communication Engineering"
      },
      { "id": 1, "name": "B.E. Mechanical Engineering" },
      { "id": 2, "name": "B.E. Civil Engineering" }
    ]
  },
  {
    "name": "Kumaraguru College of Technology,",
    "url": "https://www.kct.ac.in/wp-content/uploads/2023/01/kctnaac.png",
    "code": "2712",
    "map": "https://maps.app.goo.gl/MJ4P6p8EZC2Bsssx9",
    "district": "Coimbatore",
    "rank": "107",
    "short": "KCT",
    "num": "0422 266 1100",
    "link": "https://www.kct.ac.in/",
    "mail": "info@kct.ac.in",
    "address": "Chinnavedampatti, Coimbatore – 641 049",
    "para": "Kumaraguru College of Technology (KCT), Coimbatore is a private Engineering College started in 1984 under the auspices of Ramanandha Adigalar Foundation, a charitable educational trust of Sakthi Group. Situated in a sprawling 156-acre campus in the IT corridor of Coimbatore, KCT is an autonomous institution affiliated to the Anna University, Chennai and approved by All India Council for Technical Education (AICTE). KCT was granted Five Year Accreditation status in its first cycle of accreditation. Later, in the second cycle, with a CGPA of 3.21 on 4.0 scale, A Grade was awarded which was valid till 02 December 2021. In July 2022, following the NAAC Peer Team visit for third cycle of accreditation, KCT has been awarded A++ Grade, the highest grade awarded to institutions by NAAC with KCT securing a CGPA of 3.62 on a 4 – point scale. And all the eligible UG programs have also been accredited by National Board of Accreditation (NBA).",
    "Degree": [
      {
        "id": 0,
        "name": "B.E. Computer Science and  Engineering (Cyber Security)"
      },
      { "id": 1, "name": "B.E. Mechanical Engineering" }
    ]
  },
  {
    "name": "PSG College Of Technology",
    "url": "https://www.psgtech.edu/images/logo-G2-New.png",
    "code": "2006",
    "map": "https://maps.app.goo.gl/MJ4P6p8EZC2Bsssx9",
    "district": "Coimbatore",
    "rank": "63",
    "short": "PSG",
    "num": "0422-4303300",
    "link": "https://www.psgtech.edu/",
    "mail": "dean.admn@psgtech.ac.in",
    "address": "Pelamedu,Coimbatore-641004",
    "para": "The College was established in the year 1951 and the Founders wisely decided to locate it in the same campus as the PSG Industrial Institute for effective industry-institute interaction. The PSG College of Technology is situated at about 8 km from Coimbatore Railway Station and 5 km from Airport.",
    "Degree": [
      {
        "id": 0,
        "name": "B.E. Computer Science and  Engineering (Cyber Security)"
      },
      { "id": 1, "name": "B.E. Mechanical Engineering" },
      { "id": 2, "name": "B.E. Civil Engineering" }
    ]
  },
  {
    "name": "SRM Valliammai Engineering College",
    "url": "https://srmvalliammai.ac.in/wp-content/uploads/2022/06/new-logo1-1.png",
    "code": "1422",
    "map": "https://www.google.com/maps/dir/10.9358502,76.9527723/srm+valliammai/@11.851285,75.852846,7z/data=!3m1!4b1!4m9!4m8!1m1!4e1!1m5!1m1!1s0x3a52f70d79722631:0x49afcd4648f94894!2m2!1d80.0413021!2d12.8259451?entry=ttu",
    "district": "Chengalpattu",
    "rank": "55",
    "short": "SRMV",
    "num": "044 – 27454784 ",
    "link": "https://srmvalliammai.ac.in/",
    "mail": "srmvec@srmvalliammai.ac.in",
    "address": "SRM Nagar ,Kattankulathur Chengalpattu–603203",
    "para":"SRM Valliammai Engineering college (An Autonomous Institution) was established on September 9, 1999 and presently conducts 11 Under graduate courses and 8 Post graduate courses. The college has highly qualified, dynamic and dedicated renowned faculty both from academic and industrial background. Besides, the students bring laurels to the college by securing university ranks.It is situated in an extent of 13.35 acres and is by the side of NH 45, between Tambaram and Chengalpattu. The serene atmosphere with the surrounding greenery is conductive to the pursuit of higher studies.",
    "Degree": [
      {
        "id": 0,
        "name": "B.E. Computer Science and  Engineering (Cyber Security)"
      },
      { "id": 1, "name": "B.E. Mechanical Engineering" },
      { "id": 2, "name": "B.E. Civil Engineering" }
    ]
  },
  {
    "name": "Thiagarajar College Of Engineering",
    "url": "https://www.tce.edu/themes/gavias_edmix/logo.svg",
    "code": "2007",
    "map": "https://www.google.com/maps/search/thiagarajar+engineering+college+tce+map/@9.8842233,78.0670098,15z/data=!3m1!4b1?entry=ttu",
    "district": "Madurai",
    "rank": "85",
    "short": "TCE",
    "num": "+91 452 2482240",
    "link": "https://www.tce.edu/",
    "address": "Thiagarajar College Of Engineering,Madurai 625 015",
    "mail": "principal@tce.edu",
    "para": "Founded in 1957 by philanthropist and industrialist Late Shri.Karumuttu Thiagarajan Chettiar, Thiagarajar College of Engineering (TCE) is a Government Aided Institution and affiliated to Anna University and situated in Madurai, the Temple City .The college is funded by Central and State Governments and Management. The courses offered in TCE are approved by the All India Council for Technical Education (AICTE), New Delhi and Council of Architecture (COA), New Delhi. TCE was granted Autonomy in the year 1987 and the programmes have been accredited by the National Board of Accreditation (NBA). TCE offers 9 Undergraduate programmes, 10 Postgraduate programmes and Doctoral programmes in Engineering, Architecture and Science.",
    "Degree": [
      {
        "id": 0,
        "name": "B.E. Computer Science and  Engineering (Cyber Security)"
      },
      { "id": 1, "name": "B.E. Mechanical Engineering" },
      { "id": 2, "name": "B.E. Civil Engineering" }
    ]
  }
]
