[
  {
    "branch": "Cyber Security",
    "about": "In this course you will learn about the different types of cyber threat in real life and will be trained to secure the data of the people and the country.in simple words to defend a company's systems and network from online threats.",
    "jobs": [
      "Cybersecurity Analyst",
      "Security tester",
      "Network security enginner",
      "IT auditor",
      "Cybersecurity consultant",
      "information security speciatlist",
      "Cybersecurity manager"
    ],
    "responsibilities": [
      "Safeguarding information",
      "system assets Protecting systems by defining access privileges",
      "control structures and resources Implementing security improvements"
    ],
    "qualifications": [
      "System administration",
      "Network security",
      "Problem solving",
      "Information security policies",
      "On-call network troubleshooting",
      "Firewall administration",
      " Network protocols",
      "Routers, hubs, and switches",
      "Informing others",
      "Process improvement"
    ]
  },
  {
    "branch": "Civil",
    "about": "The BE Civil Engineering deals with the construction, design, and maintenance of building structures, tunnels, bridges, airports, etc. This course develops a student with the capability of planning, analyzing, and designing a project.",
    "jobs": [
      "Construction manager",
      "Project manager",
      "Civil Engineer",
      "Surveryor",
      "CAD Technician",
      "Building Engineer"
    ],
    "responsibilities": [
      "Analyze photographs, drawings and maps to inform the direction of projects as well as the overall budget constraints",
      "Ensure project feasibility through continual evaluation of structural integrity and design practicality",
      "Create designs that utilize a variety of materials",
      "Perform and adjust quantity calculations for practical and budgetary purposes",
      "Communicate with team members as well as customers and vendors to ensure maximum cohesion and fluidity on projects",
      "Forecast design and construction time frames",
      "Inspect project sites to ensure they meet relevant codes and are progressing properly"
    ],
    "qualifications": [
      "Proven working experience in civil engineering",
      "Excellent knowledge of design and visualizations software such as AutoCAD,Civil 3D or similar",
      "Proficiency in site layout, grading, utility design, erosion control, regulatory approvals etc",
      "Project management and supervision skills",
      "Strong communication and interpersonal skills",
      "License of professional engineer",
      "BS/MA in Civil Engineering"
    ]
  },
  {
    "branch": "Mechanical",
    "about": "A Mechanical Engineer designs machines like generators and engines, including applications such as elevators. They also develop machinery like refrigeration systems for grocery store food storage areas.",
    "jobs": [
      "Aerospace engineer",
      "Automotive engineer",
      "CAD technician",
      "Contracting civil engineer",
      "Control and instrumentation engineer",
      "Maintenance engineer",
      "Mechanical engineer",
      "Nuclear engineer"
    ],
    "responsibilities": [
      "Perform a full lifecycle product development (design, develop, test prototypes, manufacture and implement)",
      "Design systems and components that meet needs and requirements",
      "Produce outline designs",
      "Conduct experiments methodically, analyse data and interpret results",
      "Test and evaluate theoretical designs",
      "Identify, formulate and produce effective solutions to emerging problems",
      "Evaluate final product’s overall performance, reliability and safety",
      "Alter and modify design to meet requirements and to eliminate malfunctions",
      "Estimate budget and scope of project"
    ],
    "qualifications": [
      "Proven working experience in mechanical engineering",
      " Working experience with product lifecycle management (PLM), finite element analysis (FEA) and computational fluid dynamics (CFD)",
      " Hands-on experience with computer-aided engineering (CAM) and computer-aided manufacturing (CAE)",
      "Familiarity with 2D or 3D engineering design and manufacturing tools (e.g., AutoCAD, ProE or other)",
      "Adequate knowledge of engineering analysis tools (ANSYS, ProMechanica or similar)",
      "Mathematical computing and analysis tools knowledge (Matlab, Excel, LabView etc)"
    ]
  }
]
